// From MacBuddy
// ---------------------------------------------------------------------
// * Buttons
// ---------------------------------------------------------------------
"OK_BUTTON"		= "OK";
"CANCEL_BUTTON"		= "Avbryt";
"GOBACK_BUTTON"		= "Tillbaka";
"DIAGNOSE_BUTTON"	= "Diagnos";

// ---------------------------------------------------------------------
// * Progress message
// ---------------------------------------------------------------------
"MESSAGE_CONFIGURING"		= "Ställer in datorn...";
"MESSAGE_PREP_CONNECTION"	= "Förbereder för anslutning...";

// ---------------------------------------------------------------------
// * Fatal error
// ---------------------------------------------------------------------
"FATAL_ERROR_PANEL_TITLE"		= "Oväntat fel";
"MESSAGE_FATAL_ERROR_TITLE"		= "Ett oväntat fel uppstod.";

// ---------------------------------------------------------------------
// * Generic error
// ---------------------------------------------------------------------
"GENERIC_ERROR_PANEL_TITLE"				= "Fel";
"ERROR_MESSAGE_GENERIC_TITLE"			= "Tyvärr...";


// ---------------------------------------------------------------------
// * Data Validation
// ---------------------------------------------------------------------
"ERROR_MESSAGE_VALIDATION_FAILED_TITLE" = "Tyvärr";
"ERROR_MESSAGE_VALIDATION_WARNING_TITLE" = "Varning";
"ERROR_MESSAGE_VALIDATION_WARNING" = "Vill du fortsätta?";

                    // Required field
"ERROR_MESSAGE_VALIDATION_0001_TITLE" = "Du har inte angett all nödvändig information.";
"ERROR_MESSAGE_VALIDATION_0001" = "Fyll i fälten markerade med röd pil.";

                    // Min-length field
"ERROR_MESSAGE_VALIDATION_0002_TITLE" = "Texten du angav är för kort.";
"ERROR_MESSAGE_VALIDATION_0002" = "Kontrollera det markerade fältet och ändra den inskrivna texten.";

                    // Matching fields (e.g. password)
"ERROR_MESSAGE_VALIDATION_0003" = "Informationen du uppgett är ogiltig.";

                    // NI Username invalid
"ERROR_MESSAGE_VALIDATION_0004_TITLE" = "Användarnamnet du angett är ogiltigt.";
"ERROR_MESSAGE_VALIDATION_0004" = "Kontrollera det markerade fältet och skriv in ett giltigt användarnamn för ditt NetInfo-nätverk.";

                    // NI Password invalid
"ERROR_MESSAGE_VALIDATION_0005_TITLE" = "Lösenordet du angett är ogiltigt.";
"ERROR_MESSAGE_VALIDATION_0005" = "Kontrollera det markerade fältet och skriv in ett giltigt lösenord.";

                    // UnixName invalid		-- refer to UsersPref
"ERROR_MESSAGE_VALIDATION_0006_TITLE" = "Namnet du angett kan inte användas.";
"ERROR_MESSAGE_VALIDATION_0006" = "Kontrollera det markerade fältet och skriv in ett annat kortnamn.";
"ERROR_MESSAGE_VALIDATION_0007" = "Det finns redan en användare med det här kortnamnet. Ange ett annat kortnamn.";

                    // IPAddress invalid	-- refer to Open Transport
					// "ERROR_MESSAGE_VALIDATION_0008" - NSIPAddressIsValid
"ERROR_MESSAGE_VALIDATION_0009" = "IP-adressen du angav är tom.";
"ERROR_MESSAGE_VALIDATION_0010" = "IP-adressen som du har angett innehåller ogiltiga tecken.";
"ERROR_MESSAGE_VALIDATION_0011_TITLE" = "Adressen måste bestå av fyra segment."; // too few segments
"ERROR_MESSAGE_VALIDATION_0011" = "Kontrollera det markerade fältet och skriv in en giltig adress. Om du inte har den här informationen, frågar du nätverksadministratören.";
"ERROR_MESSAGE_VALIDATION_0012_TITLE" = "Adressen måste bestå av fyra segment."; // too many segments
"ERROR_MESSAGE_VALIDATION_0012" = "Kontrollera det markerade fältet och skriv in en giltig adress. Om du inte har den här informationen, frågar du nätverksadministratören.";
"ERROR_MESSAGE_VALIDATION_0013_TITLE" = "Varje adressegment måste innehålla mellan ett och tre tecken."; // no segments
"ERROR_MESSAGE_VALIDATION_0013" = "Kontrollera det markerade fältet och skriv in en giltig adress. Om du inte har den här informationen, frågar du nätverksadministratören.";
"ERROR_MESSAGE_VALIDATION_0014_TITLE" = "Adressen du angett är ogiltig.";
"ERROR_MESSAGE_VALIDATION_0014" = "Kontrollera det markerade fältet och skriv in en giltig adress. Om du inte har den här informationen, frågar du nätverksadministratören.";

                    // SubnetMask invalid
"ERROR_MESSAGE_VALIDATION_0015_TITLE" = "Delnätsmasken du angett är ogiltig.";
"ERROR_MESSAGE_VALIDATION_0015" = "Kontrollera det markerade fältet och skriv in en giltig delnätsmask. Om du inte har den här informationen, frågar du nätverksadministratören.";

                    // notNIUsername
"ERROR_MESSAGE_VALIDATION_0016" = "Namnet du angett finns redan i ditt NetInfo-nätverk. Du kommer inte att kunna logga in på NetInfo med det här namnet.";

                    // Unique fields
"ERROR_MESSAGE_VALIDATION_0017" = "Du kan inte ha samma värde.";

                    // Wireless Network password
"ERROR_MESSAGE_VALIDATION_0018" = "Lösenordet du angett är ogiltigt.";

"ERROR_MESSAGE_VALIDATION_0019_TITLE" = "Det betalkortsnummer du angett kan inte användas.";
"ERROR_MESSAGE_VALIDATION_0019" = "Kontrollera det markerade fältet och skriv in ett giltigt betalkortsnummer.";

                    // Account name
"ERROR_MESSAGE_VALIDATION_0020" = "Ditt kontonamn får inte börja med en siffra.";

                    // EMail address
"ERROR_MESSAGE_VALIDATION_0021" = "Den e-postadress du angett kan vara oanvändbar.";

                    // SubnetMask & IPAddress, Router consistency check
"ERROR_MESSAGE_VALIDATION_0022" = "IP-adressen och routeradressen överensstämmer inte med delnätsmasken du angav. Kontrollera följande fält och ange giltiga värden:\n     IP-adress\n     Delnätsmask\n     Routeradress\nOm du inte har den här informationen frågar du nätverksadministratören.";

                    // Wrong long username
"ERROR_MESSAGE_VALIDATION_0023_TITLE" = "Namnet du angett kan inte användas.";
"ERROR_MESSAGE_VALIDATION_0023" = "Kontrollera det markerade fältet och välj ett annat namn.";

                    // Unique Array
"ERROR_MESSAGE_VALIDATION_0024_TITLE" = "Det finns dubbletter.";
"ERROR_MESSAGE_VALIDATION_0024" = "Kontrollera det markerade fältet och skriv in unika värden. ";

// ---------------------------------------------------------------------
// * System Configuration
// ---------------------------------------------------------------------
"MESSAGE_NO_DIAL_TONE_TITLE"			= "Modemet får ingen kopplingston.";
"MESSAGE_NO_DIAL_TONE"					= "Kontrollera att modemet är anslutet och klicka på OK, eller klicka på Avbryt och gå tillbaka och markera kryssrutan Ignorera kopplingston.";

// ========== Network Setup Assistant addition ==========
"QUIT_BUTTON"		= "Avsluta";
                                        // Field specific errors
"ERROR_PASSWORD_DO_NOT_MATCH_TITLE" = "Lösenorden överensstämmer inte.";
"ERROR_PASSWORD_DO_NOT_MATCH" = "Kontrollera fälten markerade med röda pilar och ange samma lösenord i bägge fälten.";

"ERROR_MUST_ENTER_LOCATION_NAME_TITLE" = "Ange ett platsnamn.";
"ERROR_MUST_ENTER_LOCATION_NAME" = "Du skapar en ny nätverksplats där inställningsinformationen sparas. Du måste ange ett platsnamn nu.";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME_TITLE" = "Ange ett annat platsnamn.";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME" = "Platsnamnet du har angett finns redan. Skriv in ett annat namn.";


"MESSAGE_TASK_FORMAT" = "”%1$@anslutning via %2$@”"; // %1$@ = CONNECTION, %2$@ = CONFIGURATION
"CONNECTION_Wireless" = "Trådlös ";
"CONNECTION_Modem" = "Modem";
"CONNECTION_DSL" = "DSL-";
"CONNECTION_CableModem" = "Kabelmodem";
"CONNECTION_Lan" = "Lokalt nätverk";
"CONFIGURE_PPP" = "PPP-";
"CONFIGURE_DHCP" = "DHCP-";
"CONFIGURE_DHCPClientID" = "DHCP med klient-ID, ";
"CONFIGURE_PPPoE" = "PPPoE-";
"CONFIGURE_Manual" = "Statisk IP-";

"MESSAGE_TITLE_CONFIGURE" = "Ställer in...";
"MESSAGE_FAILED_CONFIGURE" = "Inställningen misslyckades.";
"MESSAGE_DONE_CONFIGURE" = "Slutför inställning.";
"MESSAGE_CHECKING_CONNECTION" = "Kontrollerar din nätverksanslutning...";
"MESSAGE_CONNECTED" = "Nätverksanslutningen har upprättats.";
"MESSAGE_NOT_CONNECTED" = "Kan inte upprätta en nätverksanslutning.";
"MESSAGE_NOT_CONNECTED_TRY_AGAIN" = "Datorn kunde inte ansluta till Internet. Klicka på OK eller gå tillbaka och ändra nätverksinställningarna, och försök igen.";

"DEFAULT_LOCATION_NAME" = "Nätverksplats (%@)";
"DUPLICATE_LOCATION_NAME" = "%1$@ %2$d";